from script.validation import check_object_in_reverse_request
import pytest


@pytest.mark.parametrize(
    "lat, lon, data, expected_result",
    [
        (
            "44.261539",
            "77.548874",
            {
                "place_id": 358078561,
                "licence": "Data © OpenStreetMap contributors, ODbL 1.0. https://osm.org/copyright",
                "osm_type": "way",
                "osm_id": 231680019,
                "lat": "44.261539",
                "lon": "77.548874",
                "display_name": "Жоламан, Кербұлақ ауданы, Жетісу облысы, Қазақстан",
                "address": {
                    "village": "Жоламан",
                    "county": "Кербұлақ ауданы",
                    "state": "Жетісу облысы",
                    "ISO3166-2-lvl4": "KZ-33",
                    "country": "Қазақстан",
                    "country_code": "kz"
                },
                "namedetails": {
                    "name": "Жоламан",
                    "name:kk": "Жоламан",
                    "name:ru": "Жоламан",
                    "name:tg": "Ҷоламан",
                    "name:tt": "Җоламан",
                    "name:uk": "Жоламан",
                    "int_name": "Jolaman"
                },
                "boundingbox": [
                    "44.2579677",
                    "44.2705942",
                    "77.5330291",
                    "77.556511"
                ],
                "geojson": {
                    "type": "Polygon",
                    "coordinates": [
                        [
                            [
                                77.5330291,
                                44.2695504
                            ],
                            [
                                77.5334449,
                                44.2687531
                            ],
                            [
                                77.5340145,
                                44.2665898
                            ],
                            [
                                77.5347282,
                                44.2637426
                            ],
                            [
                                77.5349528,
                                44.2627082
                            ],
                            [
                                77.5348312,
                                44.2616318
                            ],
                            [
                                77.53528,
                                44.2615873
                            ],
                            [
                                77.5376777,
                                44.2615544
                            ],
                            [
                                77.5400782,
                                44.2615043
                            ],
                            [
                                77.541681,
                                44.2597375
                            ],
                            [
                                77.542243,
                                44.2598924
                            ],
                            [
                                77.5420925,
                                44.2603085
                            ],
                            [
                                77.5417555,
                                44.2605898
                            ],
                            [
                                77.5420803,
                                44.2603974
                            ],
                            [
                                77.5424209,
                                44.2603013
                            ],
                            [
                                77.5431337,
                                44.2601941
                            ],
                            [
                                77.5443091,
                                44.259882
                            ],
                            [
                                77.5474364,
                                44.2579677
                            ],
                            [
                                77.5507099,
                                44.2588988
                            ],
                            [
                                77.5522939,
                                44.2592647
                            ],
                            [
                                77.5539793,
                                44.2589578
                            ],
                            [
                                77.5549367,
                                44.2590775
                            ],
                            [
                                77.556511,
                                44.2599801
                            ],
                            [
                                77.5563515,
                                44.2606612
                            ],
                            [
                                77.5549157,
                                44.2614912
                            ],
                            [
                                77.554226,
                                44.2620235
                            ],
                            [
                                77.5535015,
                                44.2625751
                            ],
                            [
                                77.5531299,
                                44.2634111
                            ],
                            [
                                77.5539017,
                                44.2640119
                            ],
                            [
                                77.5535042,
                                44.2653078
                            ],
                            [
                                77.5451936,
                                44.2661624
                            ],
                            [
                                77.5432838,
                                44.2688376
                            ],
                            [
                                77.5345052,
                                44.2705942
                            ],
                            [
                                77.5330291,
                                44.2695504
                            ]
                        ]
                    ]
                }
            },
            True
        )
    ]
)
def test_reverse_request_validation_positive(lat, lon, data, expected_result):
    assert check_object_in_reverse_request(lat, lon, data) == expected_result


@pytest.mark.parametrize(
    "lat, lon, data, expected_result",
    [
        (
            "44.261539",
            "77.548874",
            {
                "place_id": 358078561,
                "licence": "Data © OpenStreetMap contributors, ODbL 1.0. https://osm.org/copyright",
                "osm_type": "node",
                "osm_id": 231680019,
                "lat": "44.261539",
                "lon": "77.548874",
                "display_name": "Жоламан, Кербұлақ ауданы, Жетісу облысы, Қазақстан",
                "address": {
                    "village": "Жоламан",
                    "county": "Кербұлақ ауданы",
                    "state": "Жетісу облысы",
                    "ISO3166-2-lvl4": "KZ-33",
                    "country": "Қазақстан",
                    "country_code": "kz"
                },
                "namedetails": {
                    "name": "Жоламан",
                    "name:kk": "Жоламан",
                    "name:ru": "Жоламан",
                    "name:tg": "Ҷоламан",
                    "name:tt": "Җоламан",
                    "name:uk": "Жоламан",
                    "int_name": "Jolaman"
                },
                "boundingbox": [
                    "44.2579677",
                    "44.2705942",
                    "77.5330291",
                    "77.556511"
                ],
                "geojson": {
                    "type": "Polygon",
                    "coordinates": [
                        [
                            [
                                77.5330291,
                                44.2695504
                            ],
                            [
                                77.5334449,
                                44.2687531
                            ],
                            [
                                77.5340145,
                                44.2665898
                            ],
                            [
                                77.5347282,
                                44.2637426
                            ],
                            [
                                77.5349528,
                                44.2627082
                            ],
                            [
                                77.5348312,
                                44.2616318
                            ],
                            [
                                77.53528,
                                44.2615873
                            ],
                            [
                                77.5376777,
                                44.2615544
                            ],
                            [
                                77.5400782,
                                44.2615043
                            ],
                            [
                                77.541681,
                                44.2597375
                            ],
                            [
                                77.542243,
                                44.2598924
                            ],
                            [
                                77.5420925,
                                44.2603085
                            ],
                            [
                                77.5417555,
                                44.2605898
                            ],
                            [
                                77.5420803,
                                44.2603974
                            ],
                            [
                                77.5424209,
                                44.2603013
                            ],
                            [
                                77.5431337,
                                44.2601941
                            ],
                            [
                                77.5443091,
                                44.259882
                            ],
                            [
                                77.5474364,
                                44.2579677
                            ],
                            [
                                77.5507099,
                                44.2588988
                            ],
                            [
                                77.5522939,
                                44.2592647
                            ],
                            [
                                77.5539793,
                                44.2589578
                            ],
                            [
                                77.5549367,
                                44.2590775
                            ],
                            [
                                77.556511,
                                44.2599801
                            ],
                            [
                                77.5563515,
                                44.2606612
                            ],
                            [
                                77.5549157,
                                44.2614912
                            ],
                            [
                                77.554226,
                                44.2620235
                            ],
                            [
                                77.5535015,
                                44.2625751
                            ],
                            [
                                77.5531299,
                                44.2634111
                            ],
                            [
                                77.5539017,
                                44.2640119
                            ],
                            [
                                77.5535042,
                                44.2653078
                            ],
                            [
                                77.5451936,
                                44.2661624
                            ],
                            [
                                77.5432838,
                                44.2688376
                            ],
                            [
                                77.5345052,
                                44.2705942
                            ],
                            [
                                77.5330291,
                                44.2695504
                            ]
                        ]
                    ]
                }
            },
            False
        )
    ]
)
def test_reverse_request_validation_bad_osm_type(lat, lon, data, expected_result):
    assert check_object_in_reverse_request(lat, lon, data) == expected_result


@pytest.mark.parametrize(
    "lat, lon, data, expected_result",
    [
        (
            "44.261539",
            "77.548874",
            {
                "place_id": 358078561,
                "licence": "Data © OpenStreetMap contributors, ODbL 1.0. https://osm.org/copyright",
                "osm_type": "way",
                "osm_id": 231680019,
                "lat": "44.261539",
                "lon": "77.548874",
                "display_name": "Жоламан, Кербұлақ ауданы, Жетісу облысы, Қазақстан",
                "address": {
                    "village": "Жоламан",
                    "county": "Кербұлақ ауданы",
                    "state": "Жетісу облысы",
                    "ISO3166-2-lvl4": "KZ-33",
                    "country": "Қазақстан",
                    "country_code": "kz"
                },
                "namedetails": {
                    "name": "Жоламан",
                    "name:kk": "Жоламан",
                    "name:ru": "Жоламан",
                    "name:tg": "Ҷоламан",
                    "name:tt": "Җоламан",
                    "name:uk": "Жоламан",
                    "int_name": "Jolaman"
                },
                "boundingbox": [
                    "44.2579677",
                    "44.2705942",
                    "77.5330291",
                    "77.556511"
                ],
                "geojson": {
                    "type": "Point",
                    "coordinates": [
                            80.2713895,
                            50.3620367
                        ]
                }
            },
            False
        )
    ]
)
def test_reverse_request_validation_bad_polygon(lat, lon, data, expected_result):
    assert check_object_in_reverse_request(lat, lon, data) == expected_result


@pytest.mark.parametrize(
    "lat, lon, data, expected_result",
    [
        (
            "44.261539",
            "77.548874",
            {
                "place_id": 358078561,
                "licence": "Data © OpenStreetMap contributors, ODbL 1.0. https://osm.org/copyright",
                "osm_type": "way",
                "osm_id": 231680019,
                "lat": "54.261539",
                "lon": "23.548874",
                "display_name": "Жоламан, Кербұлақ ауданы, Жетісу облысы, Қазақстан",
                "address": {
                    "village": "Жоламан",
                    "county": "Кербұлақ ауданы",
                    "state": "Жетісу облысы",
                    "ISO3166-2-lvl4": "KZ-33",
                    "country": "Қазақстан",
                    "country_code": "kz"
                },
                "namedetails": {
                    "name": "Жоламан",
                    "name:kk": "Жоламан",
                    "name:ru": "Жоламан",
                    "name:tg": "Ҷоламан",
                    "name:tt": "Җоламан",
                    "name:uk": "Жоламан",
                    "int_name": "Jolaman"
                },
                "boundingbox": [
                    "44.2579677",
                    "44.2705942",
                    "77.5330291",
                    "77.556511"
                ],
                "geojson": {
                    "type": "Polygon",
                    "coordinates": [
                        [
                            [
                                77.5330291,
                                44.2695504
                            ],
                            [
                                77.5334449,
                                44.2687531
                            ],
                            [
                                77.5340145,
                                44.2665898
                            ],
                            [
                                77.5347282,
                                44.2637426
                            ],
                            [
                                77.5349528,
                                44.2627082
                            ],
                            [
                                77.5348312,
                                44.2616318
                            ],
                            [
                                77.53528,
                                44.2615873
                            ],
                            [
                                77.5376777,
                                44.2615544
                            ],
                            [
                                77.5400782,
                                44.2615043
                            ],
                            [
                                77.541681,
                                44.2597375
                            ],
                            [
                                77.542243,
                                44.2598924
                            ],
                            [
                                77.5420925,
                                44.2603085
                            ],
                            [
                                77.5417555,
                                44.2605898
                            ],
                            [
                                77.5420803,
                                44.2603974
                            ],
                            [
                                77.5424209,
                                44.2603013
                            ],
                            [
                                77.5431337,
                                44.2601941
                            ],
                            [
                                77.5443091,
                                44.259882
                            ],
                            [
                                77.5474364,
                                44.2579677
                            ],
                            [
                                77.5507099,
                                44.2588988
                            ],
                            [
                                77.5522939,
                                44.2592647
                            ],
                            [
                                77.5539793,
                                44.2589578
                            ],
                            [
                                77.5549367,
                                44.2590775
                            ],
                            [
                                77.556511,
                                44.2599801
                            ],
                            [
                                77.5563515,
                                44.2606612
                            ],
                            [
                                77.5549157,
                                44.2614912
                            ],
                            [
                                77.554226,
                                44.2620235
                            ],
                            [
                                77.5535015,
                                44.2625751
                            ],
                            [
                                77.5531299,
                                44.2634111
                            ],
                            [
                                77.5539017,
                                44.2640119
                            ],
                            [
                                77.5535042,
                                44.2653078
                            ],
                            [
                                77.5451936,
                                44.2661624
                            ],
                            [
                                77.5432838,
                                44.2688376
                            ],
                            [
                                77.5345052,
                                44.2705942
                            ],
                            [
                                77.5330291,
                                44.2695504
                            ]
                        ]
                    ]
                }
            },
            False
        )
    ]
)
def test_reverse_request_validation_bad_main_point(lat, lon, data, expected_result):
    assert check_object_in_reverse_request(lat, lon, data) == expected_result
